public/notes/20220213170236-glad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GLAD</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://www.haider.gq/base/stylesheet.css"/>
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab:wght@600&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Roboto" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Lato:wght@900&display=swap" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<div class="Haider"><a href='https://www.haider.gq/'>Haider Mirza</a></div> <div class='nav'>
      <div class='links'>
	<a href='https://www.haider.gq'>Home</a>
	<a href='https://www.haider.gq/about/about'>About</a>
	<a href='https://www.haider.gq/repos/repos'>Repos</a>
	<a href='https://www.haider.gq/projects/projects'>Projects</a>
	<a href='https://www.haider.gq/school/school'>School</a>
      </div>
      </div>
</div>
<div id="content" class="content">
<h1 class="title">GLAD</h1>

<div id="outline-container-org1591fc7" class="outline-2">
<h2 id="org1591fc7">GLAD</h2>
<div class="outline-text-2" id="text-org1591fc7">
<p>
GLAD is extention loader Library to load OpenGL and do things.
</p>
</div>
<div id="outline-container-orge885dd9" class="outline-3">
<h3 id="orge885dd9">Installation</h3>
<div class="outline-text-3" id="text-orge885dd9">
<p>
You actually have to generate the GLAD files using the following website:
<a href="https://glad.dav1d.de/">glad.david.de</a>
</p>
</div>
</div>
<div id="outline-container-org9f04f24" class="outline-3">
<h3 id="org9f04f24">Get Working</h3>
<div class="outline-text-3" id="text-org9f04f24">
<p>
Make sure you use Both this include and define.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">GLFW_INCLUDE_NONE</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;glad/gl.h&gt;</span>
</pre>
</div>
</div>
<div id="outline-container-org18be88c" class="outline-4">
<h4 id="org18be88c">NOTE</h4>
<div class="outline-text-4" id="text-org18be88c">
<p>
Be sure to include GLAD before GLFW.
The include file for GLAD includes the required OpenGL headers behind the scenes (like GL/gl.h) so be sure to include GLAD before other header files that require OpenGL (like GLFW). 
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Made with Org mode 9.4.4 using the power of Emacs 27.2</p>
</div>
</body>
</html>
